import numpy as np
arr = np.array([1, 2, 3, 4])
print(np.mean(arr))

import pandas as pd
# Початковий словник із 5 роботи
countries = {
    "Україна": {"населення": 37.0, "площа": 603.7, "континент": "Європа"},
    "Польща": {"населення": 38.0, "площа": 312.7, "континент": "Європа"},
    "Франція": {"населення": 67.8, "площа": 551.7, "континент": "Європа"},
    "Німеччина": {"населення": 84.3, "площа": 357.6, "континент": "Європа"},
    "Італія": {"населення": 59.0, "площа": 301.3, "континент": "Європа"},
    "Іспанія": {"населення": 48.5, "площа": 505.9, "континент": "Європа"},
    "Швеція": {"населення": 10.5, "площа": 450.3, "континент": "Європа"},
    "Канада": {"населення": 39.0, "площа": 9984.7, "континент": "Північна Америка"},
    "Японія": {"населення": 125.1, "площа": 377.9, "континент": "Азія"},
    "Китай": {"населення": 1400.0, "площа": 9597.0, "континент": "Азія"}
}
df = pd.DataFrame.from_dict(countries, orient='index') # Перетворення словника у DataFrame 
df.index.name = "країна"
df["щільність"] = df["населення"] / df["площа"]
print("\nПовний DataFrame:") # Виведення повного DataFrame
print(df)

import matplotlib.pyplot as plt
plt.plot([0,1,2],[3,1,4])
plt.show()